app/controllers/finger_prints_controller.rb

SELECT "finger_prints".* FROM "finger_prints"
---
  def index
    @finger_prints = FingerPrint.all

SELECT "finger_prints".* FROM "finger_prints" WHERE "finger_prints"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    #debugger
    @finger_print = FingerPrint.find(params[:id])

INSERT INTO "finger_prints" ("BSSID", "RSSI", "SD", "SSID", "created_at", "mac", "place_id", "updated_at", "xcoord", "ycoord") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    label = false
    # begin
    #   parameters = ActiveSupport::JSON.decode(request.body.read)[:finger_print]
    # rescue
    parameters = params[:finger_print]
    # end
    available = FingerPrint.new_fingerprint(parameters[:xcoord] , parameters[:ycoord], parameters[:mac])
    #debugger
    # available = 0  means that it's a new fingerprint for a new mac address
    # this means that I want to save it
    if (available == 0)
      @finger_print = FingerPrint.new(parameters)
      available = FingerPrint.fetch_last_id() + 1
      #debugger
      respond_to do |format|
        if @finger_print.save

SELECT "finger_prints".* FROM "finger_prints" WHERE "finger_prints"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "finger_prints" WHERE "finger_prints"."id" = $1  [["id", 1]]
---
  def destroy
    @finger_print = FingerPrint.find(params[:id])
    @finger_print.destroy