app/controllers/finger_prints_controller.rb

  def create
    @finger_print = FingerPrint.check_exist(params[:finger_print])

    respond_to do |format|
        format.html { redirect_to @finger_print.find(params[:id]), notice: 'FingerPrint was successfully created.' }
---
SELECT "finger_prints".* FROM "finger_prints" WHERE "finger_prints"."id" = 1 LIMIT 1