app/controllers/magnetics_controller.rb

  def index
    @magnetics = Magnetic.all
---
SELECT "magnetics".* FROM "magnetics"

  def show
    @magnetic = Magnetic.find(params[:id])
---
SELECT "magnetics".* FROM "magnetics" WHERE "magnetics"."id" = $1 LIMIT 1  [["id", "1"]]