app/controllers/magnetic_finger_prints_controller.rb

SELECT "magnetic_finger_prints".* FROM "magnetic_finger_prints"
---
  def index
    @magnetic_finger_prints = MagneticFingerPrint.all