app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE ((
SELECT "places".* FROM "places"
---
  def index
    if (params[:lat])
      @places = Place.find_nearby(params[:range], params[:lat], params[:long]).all
    else
      @places = Place.all

INSERT INTO "places" ("created_at", "latitude", "longitude", "name", "range", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sun, 04 Oct 2015 15:13:17 UTC +00:00], ["latitude", 12.4], ["longitude", 12.2], ["name", "Nile University"], ["range", 1], ["updated_at", Sun, 04 Oct 2015 15:13:17 UTC +00:00]]
---
  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "places" SET "map_file_name" = 'NU-1st-Floor_3try.svg', "map_content_type" = 'image/svg+xml', "map_file_size" = 194614, "map_updated_at" = '2015-11-27 00:12:49.764225', "updated_at" = '2015-11-27 00:13:15.949182' WHERE "places"."id" = 1
---
  def update
    @place = Place.find(params[:id])

    respond_to do |format|
      if @place.update_attributes(params[:place])