app/controllers/routers_controller.rb

  def index
    @routers = Router.all
---
SELECT "routers".* FROM "routers"