app/controllers/wifi_finger_prints_records_controller.rb

SELECT "wifi_finger_prints_records".* FROM "wifi_finger_prints_records"
---
  def index
    @wifi_finger_prints_records = WifiFingerPrintsRecord.all

SELECT "wifi_finger_prints_records".* FROM "wifi_finger_prints_records" WHERE "wifi_finger_prints_records"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @wifi_finger_prints_record = WifiFingerPrintsRecord.find(params[:id])

INSERT INTO "wifi_finger_prints_records" ("BSSID", "RSSI", "SSID", "channel", "created_at", "fingerprint_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["BSSID", "232"], ["RSSI", 123], ["SSID", "23"], ["channel", 6], ["created_at", Sun, 13 Dec 2015 18:49:13 UTC +00:00], ["fingerprint_id", 1], ["updated_at", Sun, 13 Dec 2015 18:49:13 UTC +00:00]]
---
  def create
    @wifi_finger_prints_record = WifiFingerPrintsRecord.new(params[:wifi_finger_prints_record])
    respond_to do |format|
      if @wifi_finger_prints_record.save

SELECT "wifi_finger_prints_records".* FROM "wifi_finger_prints_records" WHERE "wifi_finger_prints_records"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "wifi_finger_prints_records" WHERE "wifi_finger_prints_records"."id" = $1  [["id", 5]]
---
  def destroy
    @wifi_finger_prints_record = WifiFingerPrintsRecord.find(params[:id])
    @wifi_finger_prints_record.destroy